---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.DPartReinforcementDeleted
source: html/a7f3d5f7-5d4d-b2c2-fac8-1ff8402921e3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.DPartReinforcementDeleted Property

Reinforcement hosted on highlighted Parts will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId DPartReinforcementDeleted { get; }
```